; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	image0 - mode
	spectrograph1 - mode
	GroundStation9 - direction
	GroundStation10 - direction
	Star2 - direction
	GroundStation13 - direction
	Star4 - direction
	GroundStation0 - direction
	GroundStation5 - direction
	GroundStation7 - direction
	GroundStation3 - direction
	GroundStation12 - direction
	GroundStation11 - direction
	Star1 - direction
	GroundStation6 - direction
	GroundStation8 - direction
	Star14 - direction
	Planet15 - direction
	Star16 - direction
	Planet17 - direction
	Phenomenon18 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation10)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 image0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation13)
	(supports instrument2 spectrograph1)
	(supports instrument2 image0)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 GroundStation8)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 GroundStation13)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet15)
	(supports instrument4 image0)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation0)
	(supports instrument5 spectrograph1)
	(supports instrument5 image0)
	(calibration_target instrument5 GroundStation3)
	(calibration_target instrument5 GroundStation12)
	(calibration_target instrument5 GroundStation7)
	(calibration_target instrument5 GroundStation5)
	(supports instrument6 image0)
	(calibration_target instrument6 GroundStation6)
	(calibration_target instrument6 Star1)
	(calibration_target instrument6 GroundStation11)
	(calibration_target instrument6 GroundStation12)
	(supports instrument7 image0)
	(supports instrument7 spectrograph1)
	(calibration_target instrument7 GroundStation8)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star4)
)
(:goal (and
	(pointing satellite3 GroundStation10)
	(have_image Star14 image0)
	(have_image Planet15 image0)
	(have_image Star16 spectrograph1)
	(have_image Planet17 spectrograph1)
	(have_image Phenomenon18 image0)
))

)

; plan
1. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 6
2. (calibrate satellite2 instrument4 groundstation0)
   added: (calibrated instrument4)
   goals met: 0 of 6
3. (turn_to satellite2 planet17 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 planet17)
   goals met: 0 of 6
4. (take_image satellite2 planet17 instrument4 spectrograph1)
   added: (have_image planet17 spectrograph1)
   goals met: 1 of 6
5. (turn_to satellite2 planet15 planet17)
   deleted: (pointing satellite2 planet17)
   added: (pointing satellite2 planet15)
   goals met: 1 of 6
6. (take_image satellite2 planet15 instrument4 image0)
   added: (have_image planet15 image0)
   goals met: 2 of 6
7. (turn_to satellite2 phenomenon18 planet15)
   deleted: (pointing satellite2 planet15)
   added: (pointing satellite2 phenomenon18)
   goals met: 2 of 6
8. (take_image satellite2 phenomenon18 instrument4 image0)
   added: (have_image phenomenon18 image0)
   goals met: 3 of 6
9. (turn_to satellite2 star14 phenomenon18)
   deleted: (pointing satellite2 phenomenon18)
   added: (pointing satellite2 star14)
   goals met: 3 of 6
10. (take_image satellite2 star14 instrument4 image0)
   added: (have_image star14 image0)
   goals met: 4 of 6
11. (turn_to satellite2 star16 star14)
   deleted: (pointing satellite2 star14)
   added: (pointing satellite2 star16)
   goals met: 4 of 6
12. (take_image satellite2 star16 instrument4 spectrograph1)
   added: (have_image star16 spectrograph1)
   goals met: 5 of 6
13. (turn_to satellite3 groundstation10 star4)
   deleted: (pointing satellite3 star4)
   added: (pointing satellite3 groundstation10)
   goals met: 6 of 6
